# 12. Machine learning techniques

In [ ]:
!git clone https://github.com/s7s/machine_learning_1.git
%cd  machine_learning_1/ML_in_practice

Cloning into 'machine_learning_1'...
remote: Enumerating objects: 170, done.
remote: Counting objects: 100% (170/170), done.
remote: Compressing objects: 100% (126/126), done.
remote: Total 170 (delta 73), reused 138 (delta 41), pack-reused 0
Receiving objects: 100% (170/170), 34.10 MiB | 17.59 MiB/s, done.
Resolving deltas: 100% (73/73), done.
/content/machine_learning_1/ML_in_practice

In [ ]:
import random as rd
rd.seed(0)

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## 12.1 Loading and exploring the dataset

First, we use pandas to load the dataset from a csv file.

In [ ]:
raw_data = pd.read_csv('./titanic.csv')
raw_data

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

Next, we can explore the dataset.

In [ ]:
# Examining the length of the dataset
print("The dataset has", len(raw_data), "rows")

The dataset has 891 rows

In [ ]:
# Examining the columns in the dataset
print("Columns (features of the dataset)")
raw_data.columns

Columns (features of the dataset)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [ ]:
# Examining the labels
print("Labels")
raw_data["Survived"]

Labels

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [ ]:
# Examining how many passengers survived
print(sum(raw_data['Survived']),'passengers survived out of',len(raw_data))

342 passengers survived out of 891

In [ ]:
# One can look at several columns together
raw_data[["Name", "Age"]]

                                                  Name   Age
0                              Braund, Mr. Owen Harris  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                             Allen, Mr. William Henry  35.0
..                                                 ...   ...
886                              Montvila, Rev. Juozas  27.0
887                       Graham, Miss. Margaret Edith  19.0
888           Johnston, Miss. Catherine Helen "Carrie"   NaN
889                              Behr, Mr. Karl Howell  26.0
890                                Dooley, Mr. Patrick  32.0

[891 rows x 2 columns]

## 12.2. Cleaning up the data

Now, let's look at how many columns have missing data

In [ ]:
raw_data.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

The Cabin column is missing too many values to be useful. Let's drop it altogether.

In [ ]:
raw_data['Cabin']

0       NaN
1       C85
2       NaN
3      C123
4       NaN
       ...
886     NaN
887     B42
888     NaN
889    C148
890     NaN
Name: Cabin, Length: 891, dtype: object

In [ ]:
print("The Cabin column is missing", sum(raw_data['Cabin'].isna()), "values out of",len(raw_data['Cabin']))

The Cabin column is missing 687 values out of 891

In [ ]:
clean_data = raw_data.drop('Cabin', axis=1)

In [ ]:
clean_data

     PassengerId  Survived  Pclass  ...            Ticket     Fare  Embarked
0              1         0       3  ...         A/5 21171   7.2500         S
1              2         1       1  ...          PC 17599  71.2833         C
2              3         1       3  ...  STON/O2. 3101282   7.9250         S
3              4         1       1  ...            113803  53.1000         S
4              5         0       3  ...            373450   8.0500         S
..           ...       ...     ...  ...               ...      ...       ...
886          887         0       2  ...            211536  13.0000         S
887          888         1       1  ...            112053  30.0000         S
888          889         0       3  ...        W./C. 6607  23.4500         S
889          890         1       1  ...            111369  30.0000         C
890          891         0       3  ...            370376   7.7500         Q

[891 rows x 11 columns]

Other columns such as Age or Embarked are missing some values, but they can still be useful.

For the age column, let's fill in the missing values with the median of all ages.

For the Embarked column, let's make a new category called 'U', for Unknown port of embarkment.

In [ ]:
clean_data['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [ ]:
median_age = raw_data["Age"].median()
median_age

28.0

In [ ]:
clean_data["Age"] = clean_data["Age"].fillna(median_age)

In [ ]:
clean_data["Embarked"] = clean_data["Embarked"].fillna('U')

In [ ]:
clean_data.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [ ]:
clean_data.head()

   PassengerId  Survived  Pclass  ...            Ticket     Fare  Embarked
0            1         0       3  ...         A/5 21171   7.2500         S
1            2         1       1  ...          PC 17599  71.2833         C
2            3         1       3  ...  STON/O2. 3101282   7.9250         S
3            4         1       1  ...            113803  53.1000         S
4            5         0       3  ...            373450   8.0500         S

[5 rows x 11 columns]

### 12.2.3 Saving our data for the future

In [ ]:
clean_data.to_csv('./clean_titanic_data.csv', index=None)

## 12.3 Manipulating the features

- One-hot encoding
- Binning
- Feature selection

### 12.3.1 One-hot encoding

In [ ]:
preprocessed_data = pd.read_csv('clean_titanic_data.csv')
preprocessed_data

     PassengerId  Survived  Pclass  ...            Ticket     Fare  Embarked
0              1         0       3  ...         A/5 21171   7.2500         S
1              2         1       1  ...          PC 17599  71.2833         C
2              3         1       3  ...  STON/O2. 3101282   7.9250         S
3              4         1       1  ...            113803  53.1000         S
4              5         0       3  ...            373450   8.0500         S
..           ...       ...     ...  ...               ...      ...       ...
886          887         0       2  ...            211536  13.0000         S
887          888         1       1  ...            112053  30.0000         S
888          889         0       3  ...        W./C. 6607  23.4500         S
889          890         1       1  ...            111369  30.0000         C
890          891         0       3  ...            370376   7.7500         Q

[891 rows x 11 columns]

In [ ]:
gender_columns = pd.get_dummies(preprocessed_data['Sex'], prefix='Sex')
print(gender_columns)
embarked_columns = pd.get_dummies(preprocessed_data["Embarked"], prefix="Pclass")
print(embarked_columns)

     Sex_female  Sex_male
0             0         1
1             1         0
2             1         0
3             1         0
4             0         1
..          ...       ...
886           0         1
887           1         0
888           1         0
889           0         1
890           0         1

[891 rows x 2 columns]
     Pclass_C  Pclass_Q  Pclass_S  Pclass_U
0           0         0         1         0
1           1         0         0         0
2           0         0         1         0
3           0         0         1         0
4           0         0         1         0
..        ...       ...       ...       ...
886         0         0         1         0
887         0         0         1         0
888         0         0         1         0
889         1         0         0         0
890         0         1         0         0

[891 rows x 4 columns]

In [ ]:
preprocessed_data = pd.concat([preprocessed_data, gender_columns], axis=1)
preprocessed_data = pd.concat([preprocessed_data, embarked_columns], axis=1)

In [ ]:
preprocessed_data = preprocessed_data.drop(['Sex', 'Embarked'], axis=1)

In [ ]:
preprocessed_data

     PassengerId  Survived  Pclass  ... Pclass_Q  Pclass_S  Pclass_U
0              1         0       3  ...        0         1         0
1              2         1       1  ...        0         0         0
2              3         1       3  ...        0         1         0
3              4         1       1  ...        0         1         0
4              5         0       3  ...        0         1         0
..           ...       ...     ...  ...      ...       ...       ...
886          887         0       2  ...        0         1         0
887          888         1       1  ...        0         1         0
888          889         0       3  ...        0         1         0
889          890         1       1  ...        0         0         0
890          891         0       3  ...        1         0         0

[891 rows x 15 columns]

### 12.3.2 Binning

In [ ]:
bins = [0, 10, 20, 30, 40, 50, 60, 70, 80]
categorized_age = pd.cut(preprocessed_data['Age'], bins)
preprocessed_data['Categorized_age'] = categorized_age
preprocessed_data = preprocessed_data.drop(["Age"], axis=1)
preprocessed_data

     PassengerId  Survived  Pclass  ... Pclass_S  Pclass_U  Categorized_age
0              1         0       3  ...        1         0         (20, 30]
1              2         1       1  ...        0         0         (30, 40]
2              3         1       3  ...        1         0         (20, 30]
3              4         1       1  ...        1         0         (30, 40]
4              5         0       3  ...        1         0         (30, 40]
..           ...       ...     ...  ...      ...       ...              ...
886          887         0       2  ...        1         0         (20, 30]
887          888         1       1  ...        1         0         (10, 20]
888          889         0       3  ...        1         0         (20, 30]
889          890         1       1  ...        0         0         (20, 30]
890          891         0       3  ...        0         0         (30, 40]

[891 rows x 15 columns]

In [ ]:
cagegorized_age_columns = pd.get_dummies(preprocessed_data['Categorized_age'], prefix='Categorized_age')
preprocessed_data = pd.concat([preprocessed_data, cagegorized_age_columns], axis=1)
preprocessed_data = preprocessed_data.drop(['Categorized_age'], axis=1)
preprocessed_data

     PassengerId  Survived  ...  Categorized_age_(60, 70] Categorized_age_(70, 80]
0              1         0  ...                         0                        0
1              2         1  ...                         0                        0
2              3         1  ...                         0                        0
3              4         1  ...                         0                        0
4              5         0  ...                         0                        0
..           ...       ...  ...                       ...                      ...
886          887         0  ...                         0                        0
887          888         1  ...                         0                        0
888          889         0  ...                         0                        0
889          890         1  ...                         0                        0
890          891         0  ...                         0                        0

[891 rows x 22 columns]

### 12.3.3 Features that can be numerical or categorical

In [ ]:
class_survived = preprocessed_data[['Pclass', 'Survived']]

first_class = class_survived[class_survived['Pclass'] == 1]
second_class = class_survived[class_survived['Pclass'] == 2]
third_class = class_survived[class_survived['Pclass'] == 3]

print("In first class", sum(first_class['Survived'])/len(first_class)*100, "% of passengers survived")
print("In second class", sum(second_class['Survived'])/len(first_class)*100, "% of passengers survived")
print("In third class", sum(third_class['Survived'])/len(first_class)*100, "% of passengers survived")

In first class 62.96296296296296 % of passengers survived
In second class 40.27777777777778 % of passengers survived
In third class 55.092592592592595 % of passengers survived

One-hot encoding the Pclass feature

In [ ]:
categorized_pclass_columns = pd.get_dummies(preprocessed_data['Pclass'], prefix='Pclass')
preprocessed_data = pd.concat([preprocessed_data, categorized_pclass_columns], axis=1)
preprocessed_data = preprocessed_data.drop(['Pclass'], axis=1)
preprocessed_data

     PassengerId  Survived  ... Pclass_2  Pclass_3
0              1         0  ...        0         1
1              2         1  ...        0         0
2              3         1  ...        0         1
3              4         1  ...        0         0
4              5         0  ...        0         1
..           ...       ...  ...      ...       ...
886          887         0  ...        1         0
887          888         1  ...        0         0
888          889         0  ...        0         1
889          890         1  ...        0         0
890          891         0  ...        0         1

[891 rows x 24 columns]

### 12.3.4 Feature selection

In [ ]:
preprocessed_data = preprocessed_data.drop(['Name', 'Ticket', 'PassengerId'], axis=1)
preprocessed_data.head()

   Survived  SibSp  Parch  ...  Pclass_1  Pclass_2  Pclass_3
0         0      1      0  ...         0         0         1
1         1      1      0  ...         1         0         0
2         1      0      0  ...         0         0         1
3         1      1      0  ...         1         0         0
4         0      0      0  ...         0         0         1

[5 rows x 21 columns]

### 12.3.5 Saving for future use

In [ ]:
preprocessed_data.to_csv('./preprocessed_titanic_data.csv', index=None)

# 12.4 Training models

In [ ]:
data = pd.read_csv('./preprocessed_titanic_data.csv')
data.head()

   Survived  SibSp  Parch  ...  Pclass_1  Pclass_2  Pclass_3
0         0      1      0  ...         0         0         1
1         1      1      0  ...         1         0         0
2         1      0      0  ...         0         0         1
3         1      1      0  ...         1         0         0
4         0      0      0  ...         0         0         1

[5 rows x 21 columns]

### 12.4.1 Features-labels split and train-validation split

In [ ]:
features = data.drop(["Survived"], axis=1)
labels = data["Survived"]

In [ ]:
from sklearn.model_selection import train_test_split

In [ ]:
# remark: we fix random_state the end, to make sure we always get the same results
features_train, features_validation_test, labels_train, labels_validation_test = train_test_split(
    features, labels, test_size=0.4, random_state=100)

In [ ]:
features_validation, features_test, labels_validation, labels_test = train_test_split(
    features_validation_test, labels_validation_test, test_size=0.5, random_state=100)

In [ ]:
print(len(features_train))
print(len(features_validation))
print(len(features_test))
print(len(labels_train))
print(len(labels_validation))
print(len(labels_test))

534
178
179
534
178
179

### 12.4.2 Training different models on our dataset

We'll train six models:
- Logistic regression (perceptron)
- Decision tree
- Support vector machine (SVM)
- RandomForestClassifier
- GradientBoostingClassifier
- AdaBoostClassifier

In [ ]:
from sklearn.linear_model import LogisticRegression

lr_model = LogisticRegression()
lr_model.fit(features_train, labels_train)

/usr/local/lib/python3.7/dist-packages/sklearn/linear_model/_logistic.py:940: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  extra_warning_msg=_LOGISTIC_SOLVER_CONVERGENCE_MSG)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [ ]:
from sklearn.tree import DecisionTreeClassifier

dt_model = DecisionTreeClassifier()
dt_model.fit(features_train, labels_train)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [ ]:
from sklearn.svm import SVC

svm_model = SVC()
svm_model.fit(features_train, labels_train)

SVC(C=1.0, break_ties=False, cache_size=200, class_weight=None, coef0=0.0,
    decision_function_shape='ovr', degree=3, gamma='scale', kernel='rbf',
    max_iter=-1, probability=False, random_state=None, shrinking=True,
    tol=0.001, verbose=False)

In [ ]:
from sklearn.ensemble import RandomForestClassifier

rf_model = RandomForestClassifier()
rf_model.fit(features_train, labels_train)

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=None, max_features='auto',
                       max_leaf_nodes=None, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=100,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [ ]:
from sklearn.ensemble import GradientBoostingClassifier

gb_model = GradientBoostingClassifier()
gb_model.fit(features_train, labels_train)

GradientBoostingClassifier(ccp_alpha=0.0, criterion='friedman_mse', init=None,
                           learning_rate=0.1, loss='deviance', max_depth=3,
                           max_features=None, max_leaf_nodes=None,
                           min_impurity_decrease=0.0, min_impurity_split=None,
                           min_samples_leaf=1, min_samples_split=2,
                           min_weight_fraction_leaf=0.0, n_estimators=100,
                           n_iter_no_change=None, presort='deprecated',
                           random_state=None, subsample=1.0, tol=0.0001,
                           validation_fraction=0.1, verbose=0,
                           warm_start=False)

In [ ]:
from sklearn.ensemble import AdaBoostClassifier

ab_model = AdaBoostClassifier()
ab_model.fit(features_train, labels_train)

AdaBoostClassifier(algorithm='SAMME.R', base_estimator=None, learning_rate=1.0,
                   n_estimators=50, random_state=None)

### 12.4.3 Evaluating the models

#### Accuracy

In [ ]:
print("Scores of the models")
print("Logistic regression:", lr_model.score(features_validation, labels_validation))
print("Decision tree:", dt_model.score(features_validation, labels_validation))
print("SVM:", svm_model.score(features_validation, labels_validation))
print("Random forest:", rf_model.score(features_validation, labels_validation))
print("Gradient boosting:", gb_model.score(features_validation, labels_validation))
print("AdaBoost:", ab_model.score(features_validation, labels_validation))

Scores of the models
Logistic regression: 0.7696629213483146
Decision tree: 0.7640449438202247
SVM: 0.6797752808988764
Random forest: 0.7584269662921348
Gradient boosting: 0.8089887640449438
AdaBoost: 0.7640449438202247

#### F1-score

In [ ]:
from sklearn.metrics import f1_score

print("F1-scores of the models:")

lr_predicted_labels = lr_model.predict(features_validation)
print("Logistic regression:", f1_score(labels_validation, lr_predicted_labels))

dt_predicted_labels = dt_model.predict(features_validation)
print("Decision Tree:", f1_score(labels_validation, dt_predicted_labels))

svm_predicted_labels = svm_model.predict(features_validation)
print("Support Vector Machine:", f1_score(labels_validation, svm_predicted_labels))

rf_predicted_labels = rf_model.predict(features_validation)
print("Random Forest:", f1_score(labels_validation, rf_predicted_labels))

gb_predicted_labels = gb_model.predict(features_validation)
print("Gradient boosting:", f1_score(labels_validation, gb_predicted_labels))

ab_predicted_labels = ab_model.predict(features_validation)
print("AdaBoost:", f1_score(labels_validation, ab_predicted_labels))

F1-scores of the models:
Logistic regression: 0.6870229007633588
Decision Tree: 0.6769230769230768
Support Vector Machine: 0.39999999999999997
Random Forest: 0.6861313868613139
Gradient boosting: 0.7384615384615385
AdaBoost: 0.6865671641791045

### 12.4.4 Testing the model

Finding the accuracy and the F1-score of the model in the testing set.

In [ ]:
gb_model.score(features_test, labels_test)

0.8324022346368715

In [ ]:
gb_predicted_test_labels = gb_model.predict(features_test)
f1_score(labels_test, gb_predicted_test_labels)

0.8026315789473685

# 12.5 Grid search

In [ ]:
from sklearn.model_selection import GridSearchCV

In [ ]:
# Grid search with an rbf kernel

print("SVM grid search with a radial basis function kernel")

# rbf, C=1, gamma=0.1
svm_1_01 = SVC(kernel='rbf', C=1, gamma=0.1)
svm_1_01.fit(features_train, labels_train)
print("C=1, gamma=0.1", svm_1_01.score(features_validation, labels_validation))

# rbf, C=1, gamma=1
svm_1_1 = SVC(kernel='rbf', C=1, gamma=1)
svm_1_1.fit(features_train, labels_train)
print("C=1, gamma=1", svm_1_1.score(features_validation, labels_validation))

# rbf, C=1, gamma=10
svm_1_10 = SVC(kernel='rbf', C=1, gamma=10)
svm_1_10.fit(features_train, labels_train)
print("C=1, gamma=10", svm_1_10.score(features_validation, labels_validation))

# rbf, C=10, gamma=0.1
svm_10_01 = SVC(kernel='rbf', C=10, gamma=0.1)
svm_10_01.fit(features_train, labels_train)
print("C=10, gamma=0.1", svm_10_01.score(features_validation, labels_validation))

# rbf, C=10, gamma=1
svm_10_1 = SVC(kernel='rbf', C=10, gamma=1)
svm_10_1.fit(features_train, labels_train)
print("C=10, gamma=1", svm_10_1.score(features_validation, labels_validation))

# rbf, C=10, gamma=10
svm_10_10 = SVC(kernel='rbf', C=10, gamma=10)
svm_10_10.fit(features_train, labels_train)
print("C=10, gamma=10", svm_10_10.score(features_validation, labels_validation))

SVM grid search with a radial basis function kernel
C=1, gamma=0.1 0.702247191011236
C=1, gamma=1 0.6966292134831461
C=1, gamma=10 0.6685393258426966
C=10, gamma=0.1 0.7247191011235955
C=10, gamma=1 0.6910112359550562
C=10, gamma=10 0.651685393258427

In [ ]:
svm_parameters = {'kernel': ['rbf'],
                  'C': [0.01, 0.1, 1 , 10, 100],
                  'gamma': [0.01, 0.1, 1, 10, 100]
                }
svm = SVC()
svm_gs = GridSearchCV(estimator = svm,
                      param_grid = svm_parameters)
svm_gs.fit(features_train, labels_train)

svm_winner = svm_gs.best_estimator_
svm_winner

svm_winner.score(features_validation, labels_validation)

0.7191011235955056

In [ ]:
svm_winner

SVC(C=10, break_ties=False, cache_size=200, class_weight=None, coef0=0.0,
    decision_function_shape='ovr', degree=3, gamma=0.01, kernel='rbf',
    max_iter=-1, probability=False, random_state=None, shrinking=True,
    tol=0.001, verbose=False)

# 12.6 Cross validation

In [ ]:
svm_gs.cv_results_

{'mean_fit_time': array([0.01146932, 0.01095204, 0.01121502, 0.01142626, 0.00999713,
        0.01128831, 0.01098104, 0.01168609, 0.01189613, 0.011868  ,
        0.0107234 , 0.01193614, 0.01178956, 0.01230612, 0.01086192,
        0.01221704, 0.01281424, 0.0168766 , 0.01336317, 0.0117857 ,
        0.01551938, 0.01880617, 0.01350565, 0.01435556, 0.01181064]),
 'mean_score_time': array([0.00360737, 0.00333462, 0.0035358 , 0.00351882, 0.00320325,
        0.00350428, 0.00335116, 0.00378857, 0.00350027, 0.00345354,
        0.00314732, 0.00362058, 0.00338411, 0.0034863 , 0.00315452,
        0.00286999, 0.00301523, 0.0038156 , 0.00329437, 0.00310659,
        0.00278459, 0.00297079, 0.00331264, 0.00330405, 0.00308828]),
 'mean_test_score': array([0.64607653, 0.64607653, 0.64607653, 0.64607653, 0.64607653,
        0.65730912, 0.64607653, 0.64607653, 0.64607653, 0.64607653,
        0.69851878, 0.76411568, 0.72294128, 0.69289367, 0.69664962,
        0.8071945 , 0.75469935, 0.72294128, 0.6929113 , 0.69476283,
        0.80340328, 0.74907424, 0.71359549, 0.69478046, 0.69476283]),
 'param_C': masked_array(data=[0.01, 0.01, 0.01, 0.01, 0.01, 0.1, 0.1, 0.1, 0.1, 0.1,
                    1, 1, 1, 1, 1, 10, 10, 10, 10, 10, 100, 100, 100, 100,
                    100],
              mask=[False, False, False, False, False, False, False, False,
                    False, False, False, False, False, False, False, False,
                    False, False, False, False, False, False, False, False,
                    False],
        fill_value='?',
             dtype=object),
 'param_gamma': masked_array(data=[0.01, 0.1, 1, 10, 100, 0.01, 0.1, 1, 10, 100, 0.01,
                    0.1, 1, 10, 100, 0.01, 0.1, 1, 10, 100, 0.01, 0.1, 1,
                    10, 100],
              mask=[False, False, False, False, False, False, False, False,
                    False, False, False, False, False, False, False, False,
                    False, False, False, False, False, False, False, False,
                    False],
        fill_value='?',
             dtype=object),
 'param_kernel': masked_array(data=['rbf', 'rbf', 'rbf', 'rbf', 'rbf', 'rbf', 'rbf', 'rbf',
                    'rbf', 'rbf', 'rbf', 'rbf', 'rbf', 'rbf', 'rbf', 'rbf',
                    'rbf', 'rbf', 'rbf', 'rbf', 'rbf', 'rbf', 'rbf', 'rbf',
                    'rbf'],
              mask=[False, False, False, False, False, False, False, False,
                    False, False, False, False, False, False, False, False,
                    False, False, False, False, False, False, False, False,
                    False],
        fill_value='?',
             dtype=object),
 'params': [{'C': 0.01, 'gamma': 0.01, 'kernel': 'rbf'},
  {'C': 0.01, 'gamma': 0.1, 'kernel': 'rbf'},
  {'C': 0.01, 'gamma': 1, 'kernel': 'rbf'},
  {'C': 0.01, 'gamma': 10, 'kernel': 'rbf'},
  {'C': 0.01, 'gamma': 100, 'kernel': 'rbf'},
  {'C': 0.1, 'gamma': 0.01, 'kernel': 'rbf'},
  {'C': 0.1, 'gamma': 0.1, 'kernel': 'rbf'},
  {'C': 0.1, 'gamma': 1, 'kernel': 'rbf'},
  {'C': 0.1, 'gamma': 10, 'kernel': 'rbf'},
  {'C': 0.1, 'gamma': 100, 'kernel': 'rbf'},
  {'C': 1, 'gamma': 0.01, 'kernel': 'rbf'},
  {'C': 1, 'gamma': 0.1, 'kernel': 'rbf'},
  {'C': 1, 'gamma': 1, 'kernel': 'rbf'},
  {'C': 1, 'gamma': 10, 'kernel': 'rbf'},
  {'C': 1, 'gamma': 100, 'kernel': 'rbf'},
  {'C': 10, 'gamma': 0.01, 'kernel': 'rbf'},
  {'C': 10, 'gamma': 0.1, 'kernel': 'rbf'},
  {'C': 10, 'gamma': 1, 'kernel': 'rbf'},
  {'C': 10, 'gamma': 10, 'kernel': 'rbf'},
  {'C': 10, 'gamma': 100, 'kernel': 'rbf'},
  {'C': 100, 'gamma': 0.01, 'kernel': 'rbf'},
  {'C': 100, 'gamma': 0.1, 'kernel': 'rbf'},
  {'C': 100, 'gamma': 1, 'kernel': 'rbf'},
  {'C': 100, 'gamma': 10, 'kernel': 'rbf'},
  {'C': 100, 'gamma': 100, 'kernel': 'rbf'}],
 'rank_test_score': array([17, 17, 17, 17, 17, 16, 17, 17, 17, 17,  9,  3,  6, 15, 10,  1,  4,
         6, 14, 12,  2,  5,  8, 11, 12], dtype=int32),
 'split0_test_score': array([0.64485981, 0.64485981, 0.64485981, 0.64485981, 0.64485981,
        0.65420561, 0.64485981, 0.64485981, 0.64485981, 0.64485981,
        0.71962617, 0.73831776, 0.6728972 , 0.70093458, 0.70093458,
        0.82242991, 0.71962617, 0.6728972 , 0.70093458, 0.70093458,
        0.80373832, 0.74766355, 0.6635514 , 0.70093458, 0.70093458]),
 'split1_test_score': array([0.64485981, 0.64485981, 0.64485981, 0.64485981, 0.64485981,
        0.65420561, 0.64485981, 0.64485981, 0.64485981, 0.64485981,
        0.64485981, 0.71028037, 0.68224299, 0.6635514 , 0.6635514 ,
        0.73831776, 0.73831776, 0.6728972 , 0.65420561, 0.6635514 ,
        0.76635514, 0.74766355, 0.64485981, 0.65420561, 0.6635514 ]),
 'split2_test_score': array([0.64485981, 0.64485981, 0.64485981, 0.64485981, 0.64485981,
        0.6728972 , 0.64485981, 0.64485981, 0.64485981, 0.64485981,
        0.71962617, 0.79439252, 0.73831776, 0.70093458, 0.71028037,
        0.81308411, 0.79439252, 0.75700935, 0.70093458, 0.71028037,
        0.82242991, 0.74766355, 0.73831776, 0.71028037, 0.71028037]),
 'split3_test_score': array([0.64485981, 0.64485981, 0.64485981, 0.64485981, 0.64485981,
        0.64485981, 0.64485981, 0.64485981, 0.64485981, 0.64485981,
        0.70093458, 0.77570093, 0.74766355, 0.70093458, 0.70093458,
        0.81308411, 0.75700935, 0.73831776, 0.70093458, 0.70093458,
        0.80373832, 0.74766355, 0.74766355, 0.70093458, 0.70093458]),
 'split4_test_score': array([0.6509434 , 0.6509434 , 0.6509434 , 0.6509434 , 0.6509434 ,
        0.66037736, 0.6509434 , 0.6509434 , 0.6509434 , 0.6509434 ,
        0.70754717, 0.80188679, 0.77358491, 0.69811321, 0.70754717,
        0.8490566 , 0.76415094, 0.77358491, 0.70754717, 0.69811321,
        0.82075472, 0.75471698, 0.77358491, 0.70754717, 0.69811321]),
 'std_fit_time': array([0.00065247, 0.00033204, 0.00027303, 0.0004656 , 0.00014495,
        0.00090407, 0.00014746, 0.00055737, 0.00073069, 0.00262696,
        0.00013277, 0.0002576 , 0.00024031, 0.00105126, 0.00013025,
        0.00048848, 0.00079013, 0.00233426, 0.00047184, 0.00055403,
        0.0012187 , 0.00203971, 0.00047173, 0.00186194, 0.00036565]),
 'std_score_time': array([3.84988843e-04, 7.64898824e-05, 9.98734716e-05, 2.05252061e-04,
        2.18842833e-04, 6.46601121e-04, 5.99806181e-05, 5.19365412e-04,
        8.28826656e-05, 3.79160520e-04, 8.16388385e-05, 7.31491722e-04,
        7.00494722e-05, 1.45797014e-04, 2.10255504e-04, 7.67282107e-05,
        3.70568438e-05, 6.78727545e-04, 3.41058923e-05, 8.64170497e-05,
        2.07279561e-04, 1.21913433e-04, 4.35601640e-05, 3.18077192e-05,
        3.14565827e-05]),
 'std_test_score': array([0.00243343, 0.00243343, 0.00243343, 0.00243343, 0.00243343,
        0.00923744, 0.00243343, 0.00243343, 0.00243343, 0.00243343,
        0.02777652, 0.03476014, 0.03891829, 0.01471177, 0.01695151,
        0.03687258, 0.0251742 , 0.04235721, 0.01952157, 0.0161391 ,
        0.02017857, 0.00282137, 0.05019872, 0.02061699, 0.0161391 ])}